cfd/openfoam/incompressible/simpleFoam/02_Force_Coefs/0.orig/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

// ************************************************************************** //

#include "include/boundaryConditions"

// ************************************************************************** //

dimensions [ 0 0 -1 0 0 0 0 ];

// ************************************************************************** //

internalField uniform $turbulentOmega;

// ************************************************************************** //

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    walls
    {
        type        slip;
    }

    model
    {
        type        omegaWallFunction;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************** //
